# CannotMoveElementWithoutWorkplane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotMoveElementWithoutWorkplane Property
BuiltInFailures..::..EditingFailures Class See Also
---
Element(s) need a workplane to be moved in. There's no workplane defined in this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMoveElementWithoutWorkplane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMoveElementWithoutWorkplane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMoveElementWithoutWorkplane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace